import React, { FC } from "react";

import CloudQaDropDown from "./CloudQaDropDown";
import { FaExternalLinkAlt } from "react-icons/fa";

const CloudQa: FC = () => {
  const qaItems = [
    {
      title: "چگونه صورت حساب سرور را پرداخت میکنی؟",
      paragraph:
        "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی ",
    },
    {
      title: "آیا صورت حساب سرور با این شرایط پرداخت می شود؟",
      paragraph:
        "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، ",
    },
    {
      title: "راهی برای دریافت سرور سفارشی وجود دارد؟",
      paragraph:
        "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای ",
    },
    {
      title: "من میتونم ویندوز نصب کنم؟",
      paragraph:
        "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با ",
    },
  ];
  return (
    <section className="py-10" id="qa">
      <h2 className="text-blackColor text-2xl font-bold text-center mb-[1em]">
        سوالات متداول
      </h2>
      <div className="container bg-white p-5">
        {qaItems.map((item, index) => (
          <CloudQaDropDown
            title={item.title}
            paragraph={item.paragraph}
            key={index}
          />
        ))}
        <div className="flex justify-center items-center">
          <button className="flex items-center gap-x-1 text-blackColor border-2 border-blackColor py-1.5 px-3 rounded-md text-xs font-bold">
            سوالات بیشتر
            <FaExternalLinkAlt />
          </button>
        </div>
      </div>
    </section>
  );
};

export default CloudQa;
